app/Controllers/Home.php

    public function index()
    {
        $mahasiswa = [
            'mahasiswa'    => $this->MahasiswaModel->findAll(),
        ];
---
SELECT *
FROM `mahasiswa`

    public function insert(){

        $nim = $this->request->getVar('nim');
        $nama = $this->request->getVar('nama');
        $data = [
            'nim'    => $nim,
            'nama' => $nama,
        ];
        $this->MahasiswaModel->insert($data);
---
INSERT INTO `mahasiswa` (`nim`, `nama`) VALUES ('202039129', 'Agung Mahendra')